app/Helpers/fields_helper.php

SELECT *
FROM `user`
WHERE `id_user` = '13'
---
function getUserName($idCampo)
{
    $db  = \Config\Database::connect();
    $builder = $db->table('user');
    $builder->where('id_user', $idCampo);
    $output = $builder->get();