app/Controllers/Cita.php

SELECT `citas`.`id_cita` as `cita`, `citas`.`fecha`, `citas`.`jornada`, `citas`.`hora`, `citas`.`estado_cita`, `hr`.`nombre` as `paciente`, `cli`.`carnet`, `cli`.`nombre`
FROM `citas`
JOIN `estudiante` as `cli` ON `cli`.`id_estudiante` = `citas`.`estudiante`
JOIN `paciente` as `hr` ON `hr`.`id_paciente` = `citas`.`paciente`
---
	public function display()
	{
		$userModel = new Cita_model();

		$dataClient = $userModel
			->select('citas.id_cita as cita, citas.fecha, citas.jornada, citas.hora,
		 citas.estado_cita, hr.nombre as paciente, cli.carnet, cli.nombre')
			->join('estudiante as cli', 'cli.id_estudiante = citas.estudiante')
			->join('paciente as hr', 'hr.id_paciente = citas.paciente')
			->findAll();

INSERT INTO `citas` (`fecha`, `hora`, `jornada`, `estado_cita`, `estudiante`, `paciente`) VALUES ('2024-03-22', '00:12', 'Vespertina', 'Cancelada', '11', '1')
---
	public function registrar()
	{
		helper(['form']);
		if ($this->request->getPost()) {
			$userModel = new Cita_model();
			$userModel->save($this->request->getVar());

SELECT *
FROM `citas`
WHERE `id_cita` = '3'
 LIMIT 1
UPDATE `citas` SET `fecha` = '2024-03-03', `hora` = '00:12:00', `jornada` = 'Matutina', `estado_cita` = 'Cumplida', `estudiante` = '11', `paciente` = '1'
WHERE `id_cita` = '3'
---
	public function editar($id_cliente)
	{
		$userModel = new Cita_model();

		helper(['form']);
		$dataClient = $userModel->where('id_cita', $id_cliente)->first();
		if (!$this->request->getPost()) {
			$data['data'] = $dataClient;
			$userModel = new Estudiante_model();
			$dataDb = $userModel->findAll();
			$paciente = new Paciente_model();
			$pacientes = $paciente->findAll();
			$data['estudiantes'] = $dataDb;
			$data['pacientes'] = $pacientes;
			return view('capas/cabecera')
				. view('cita/editar', $data)
				. view('capas/footer');
		}
		$userModel->where('id_cita', $id_cliente)
			->set($this->request->getVar())
			->update();

DELETE FROM `citas`
WHERE `id_cita` = '2'
---
	public function borrar($id_cliente)
	{
		$userModel = new Cita_model();
		$userModel->where('id_cita', $id_cliente)
			->delete();