app/Controllers/Conyugue.php

	public function editar($id_cliente)
	{
		$dataModel = new Conyugue_model();

		helper(['form']);
		$dataOne = $dataModel->where('paciente', $id_cliente)->first();
		if($dataOne == NULL){
			return redirect()->to('/conyugue/registrar/'.$id_cliente);
		}
		if (!$this->request->getPost()) {
			$data['user_data'] = $dataOne;
			return view('capas/cabecera')
				. view('conyugue/editar', $data)
				. view('capas/footer');
		}
		$dataModel->where('paciente', $id_cliente)
			->set($this->request->getVar())
			->update();
---
SELECT *
FROM `conyugue`
WHERE `paciente` = '3'
 LIMIT 1