app/Controllers/Father.php

	public function display()
	{
		$fatherModel = new FatherModel();
		$dataClient = $fatherModel->findAll();
---
SELECT *
FROM `father`

	public function registrar()
	{
		if ($this->request->getPost()) {
			$fatherModel = new FatherModel();
			$userModel = new LoginModel();
			$dataPost = $this->request->getPost();
			$data = [
				'user' => $this->request->getVar('user'),
				'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
				'role' => 'Padre',
			];
			$userModel->save($data);
			$user_id = $userModel->getInsertID();

			unset($dataPost['password']);
			$dataPost['user'] = $user_id;
			$fatherModel->save($dataPost);
---
INSERT INTO `user` (`user`, `password`, `role`) VALUES ('test', '$2y$10$medYhiNTuMGAFkefK8sHfu6rW7S8CRkcur104uUnrMnDs8oyxG2EK', 'Padre')
INSERT INTO `father` (`name`, `address`, `mobile`, `user`) VALUES ('test', 'test', 'test', 13)

	public function editar($id)
	{
		helper(['form']);
		$fatherModel = new FatherModel();
		$dataClient = $fatherModel->where('id_father', $id)->first();
		if (!$this->request->getPost()) {
			$data['data'] = $dataClient;
			return view('layer/head') .
				view('father/editar', $data)
				. view('layer/footer');
		}
		$fatherModel->where('id_father', $id)
			->set($this->request->getPost())
			->update();
---
SELECT *
FROM `father`
WHERE `id_father` = '2'
 LIMIT 1
UPDATE `father` SET `name` = 'test23', `address` = 'test23', `mobile` = 'test23'
WHERE `id_father` = '2'