app/Controllers/Test.php

DELETE FROM `test`
WHERE `id_test` = '3'
---
	public function borrar($id_cliente)
	{
		$userModel = new Test_model();
		$userModel->where('id_test', $id_cliente)
			->delete();

SELECT *
FROM `test`
---
	public function registrartest($idPaciente)
	{
		helper(['form']);
		if ($this->request->getPost()) {
			$userModel = new Test_Paciente_model();
			$data = $this->request->getVar();
			$data['paciente'] = $idPaciente;
			$userModel->save($data);
			$this->session->setFlashdata('no_access', 'El registro ha sido agregado con éxito');
			return redirect()->to('/paciente/display');
		} else {
			$testModel = new Test_model();
			$data['id'] = $idPaciente;
			$data['test'] = $testModel->findAll();